/*
libSWAarchive - a light, fast and portable library for handling Sonic World
Adventure's/Unleashed's archive file formats (.ar/.arl).

1. Introduction
===========================================================================
	- To use the library, you must do the following in EXACTLY _one_ C/C++ file:
	```c
		#define SISWA_ARCHIVE_IMPLEMENTATION
		#include "libSUarchive.h"
	```
	Once that's set, other files do not require the '#define' line.

	- There are two primary methods of using the libSUarchive library. The first
	one is using 'siswa_<ar/arl>Make(const char*)`, which utilizes the C standard
	library's IO functions, and its heap memory allocation functions. Making use
	of this method requires the C standard, as well as to call 'siswa_<ar/arl>Free`
	or simply `free(var.data)` at the end.

	If you cannot use the IO functions or want to specify your own buffer, the
	`siswa_<ar/arl>MakeBuffer(void*, size_t)` functions achieve the same results
	as the previously mentioned ones, except a buffer and the size of it is requested.

	Both methods also contain expanded versions (siswa_<func>Ex), where you can
	either specify for more memory to be allocated (required for adding more
	entries) or to specify the full capacity of the buffer.

2. Configuration macros
===========================================================================
	- For any of the macros to work, you must _always_ define it before including
	the library. Example:
	```c

	- HedgeLib (https://github.com/Radfordhound/HedgeLib) - some of the header
		documentation were taken from 'hl_hh_archive.h'.
	- sinfl.h (https://github.com/vurtun/lib) - the base code forming the Deflate
		decompressing function in siswa.
	- General Schnitzel - some general help, moral support(?) as well as providing
		useful .ar files to test the library with.

LICENSE:
	- This software is licensed under the zlib license (see the LICENSE in the
	bottom of the file).

NOTICE:
	- This library is _slightly_ experimental and features may not work as
	expected.
	- This also means that functions may not be documented fully.
*/

#ifndef SISWA_INCLUDE_SISWA_H
#define SISWA_INCLUDE_SISWA_H

#if defined(__cplusplus)
extern "C" {
#endif

#ifndef SISWA_NO_STDINT
	#if defined(__STDC_VERSION__) || (defined(__cplusplus) && __cplusplus >= 201103L)
		#include <stdint.h>
	#endif
	#include <stddef.h>
#endif

#ifndef SISWA_NO_STDLIB
	#include <stdlib.h>
	#include <stdio.h>
#endif

#ifdef NDEBUG
	#define SISWA_NO_ASSERT
#endif

#ifndef SISWA_NO_ASSERT
	#ifndef SISWA_ASSERT_MSG
		#define SISWA_ASSERT_MSG(condition, msg) do { \
			if ((condition) == 0) { \
				fprintf( \
					stderr, \
					"Assertion \"" #condition "\" at \"" __FILE__ ":%d\": " #msg ".", \
					__LINE__ \
				); \
				abort(); \
			} \
		} while (0)
	#endif
#else
	#define SISWA_ASSERT_MSG(condition, msg)  ((void)(condition), (void)(msg))
#endif

#ifndef SISWA_MEMCPY
	#include <string.h>
	#define SISWA_MEMCPY memcpy
	#define SISWA_MEMSET memset
#endif

#ifndef SISWA_STRNCMP
	#include <string.h>
	#define SISWA_STRNCMP strncmp
#endif

#ifndef SISWA_STRLEN
	#include <string.h>
	#define SISWA_STRLEN strlen
#endif


#define SISWA_ASSERT_NOT_NULL(ptr) SISWA_ASSERT_MSG((ptr) != NULL, #ptr " must not be NULL.")
#define SISWA_ASSERT(condition) SISWA_ASSERT_MSG(condition, "Assertion '" #condition "` failed")
#define SISWA_PANIC() SISWA_ASSERT_MSG(SISWA_FALSE, "SISWA_PANIC()! Wrong data was given")

#define SISWA_STATIC_ASSERT2(cond, msg)  typedef char static_assertion_##msg[(!!(cond)) * 2 - 1] /* NOTE(EimaMei): This is absolutely stupid but somehow it works so who cares */
#define SISWA_STATIC_ASSERT1(cond, line) SISWA_STATIC_ASSERT2(cond, line)
#define SISWA_STATIC_ASSERT(cond)        SISWA_STATIC_ASSERT1(cond, __LINE__)


#if defined(SISWA_NO_STDINT) || !defined(UINT32_MAX)
	#ifndef uint8_t
		typedef unsigned char uint8_t;
	#endif

	#ifndef uint16_t
		typedef unsigned short uint16_t;
	#endif

	#ifndef int32_t
		typedef signed int int32_t;
	#endif

	#ifndef uint32_t
		typedef unsigned int uint32_t;
	#endif

	#ifndef int64_t
		#if defined(_win32) || defined(_win64) || (defined(__cygwin__) && !defined(_win32))
			typedef signed __int64 int64_t;
		#else
			typedef signed long int64_t;
		#endif
	#endif

	#ifndef yint64_t
		#if defined(_win32) || defined(_win64) || (defined(__cygwin__) && !defined(_win32))
			typedef unsigned __int64 int64_t;
		#else
			typedef unsigned long uint64_t;
		#endif
	#endif
#endif

SISWA_STATIC_ASSERT(sizeof(uint8_t) == 1);
SISWA_STATIC_ASSERT(sizeof(uint16_t) == 2);
SISWA_STATIC_ASSERT(sizeof(int32_t) == 4);
SISWA_STATIC_ASSERT(sizeof(uint32_t) == 4);
SISWA_STATIC_ASSERT(sizeof(int64_t) == 8);
SISWA_STATIC_ASSERT(sizeof(uint64_t) == 8);
SISWA_STATIC_ASSERT(sizeof(size_t) == sizeof(void*));

#ifndef siByte
	typedef uint8_t siByte;
#endif
typedef uint32_t siBool;


/* The alignment value set in the archive files. The actual proper definition
 * would be the processor's computing bit (hence why Sonic Adventure uses 64 for the
 * alignment as the X360/PS3 are both 64-bit). If for whatever reason you're planning to use the
 * library on different computing bit CPUs, you should change this value to the
 * value that matches the computing bit of the CPU, or set it as '(sizeof(size_t) * 8)'.*/
#define SISWA_DEFAULT_HEADER_ALIGNMENT 64

/* Used for storing string pointers. The higher the value, the less likely a hash
 * collision will happen. 8kb is a good middleground balance on the major OSses,
 * but probably not for actual embedded systems.*/
#define SISWA_DEFAULT_STACK_SIZE (8 * 1024)

#define SISWA_TRUE    1
#define SISWA_FALSE   0
#define SISWA_SUCCESS SISWA_TRUE
#define SISWA_FAILURE SISWA_FALSE

/* Length of the array can be anything from 1 to beyond. */
#define SISWA_UNSPECIFIED_LEN 1

#define SISWA_IDENTIFIER_ARL2 0x324C5241
#define SISWA_IDENTIFIER_XCOMPRESSION 0xEE12F50F
#define SISWA_IDENTIFIER_SEGS 0x73676573

#ifdef SISWA_USE_PRAGMA_PACK
	#pragma pack(push, 1)
#endif

typedef enum {
	SISWA_FILE_REGULAR = 1,
	SISWA_FILE_INVALID,
	SISWA_FILE_XCOMPRESS,
	SISWA_FILE_SEGS
} siFileType;

typedef struct {
	uint32_t identifier;
	uint16_t dummy;
	uint16_t chunks;
	uint32_t fullSize;
	uint32_t fullZsize;
} siSegsHeader;
SISWA_STATIC_ASSERT(sizeof(siSegsHeader) == 16);

typedef struct {
	uint16_t zSize;
	uint16_t size;
	uint32_t offset;
} siSegsEntry;
SISWA_STATIC_ASSERT(sizeof(siSegsEntry) == 8);

typedef struct { /* NOTE(EimaMei): All credit goes to https://github.com/mistydemeo/quickbms/blob/master/unz.c */
	uint32_t identifier;
	uint16_t version;
	uint16_t reserved;
	uint32_t contextFlags;
	uint32_t flags;
	uint32_t windowSize;
	uint32_t compressionPartitionSize;
	uint64_t uncompressedSize;
	uint64_t compressedSize;
	uint32_t uncompressedBlockSize;
	uint32_t compressedBlockSizeMax;
} siXCompHeader;
SISWA_STATIC_ASSERT(sizeof(siXCompHeader) == 48);


typedef struct {
	/* Always 0. */
	uint32_t unknown;
	/* Size of the header struct. Same as sizeof(siArHeader), always 16 bytes. */
	uint32_t headerSizeof;
	/* Size of the entry struct. Same as sizeof(siArEntry), always 20 bytes. */
	uint32_t entrySizeof;
	/* Alignment that's used, usually 64 for 64-bit CPUs. */
	uint32_t alignment;
} siArHeader;
SISWA_STATIC_ASSERT(sizeof(siArHeader) == 16);


typedef struct {
	/* Entire size of the entry. Equivalent to '.dataSize + .offset + sizeof(siArEntry) = .size'. */
	uint32_t size;
	/* Size of the file data itself. */
	uint32_t dataSize;
	/* Pointer offset to the data. Usually equivalent to 'strlen(name) + pad + sizeof(siArEntry) = .offset'. */
	uint32_t offset;
	/* An unsigned 64-bit file date int. Can be expressed as a pointer to an uint64_t. */
	uint8_t filedate[8];
} siArEntry;
SISWA_STATIC_ASSERT(sizeof(siArEntry) == 20);


typedef struct {
	/* Pointer to the contents of the data. If `siswa_<ar/arl>Make' or 'siswa_<ar/arl>CreateContent'
	 * was used, the data is malloced and must be freed. */
	siByte* data;
	/* Current length of the content. Changes between entry modifications. */
	size_t len;
	/* Total memory capacity of '.data'. */
	size_t cap;

	/* Type of file. Denotes if the provided data is compressed or even valid. */
	siFileType type;
	/* Current entry offset, modified by 'siswa_<ar/arl>EntryPoll'. Should not
	 * be modified by the user under normal circumstances.*/
	size_t __curOffset;
} siArFile;


/* Creates a 'siArFile' structure from an '.ar' file. */
siArFile siswa_arMake(const char* path);
/* Creates a 'siArFile' structure from an '.ar' file and adds additional space to the capacity. */
siArFile siswa_arMakeEx(const char* path, size_t additionalAllocSpace);
/* Creates a 'siArFile' structure from an archive file's content in memory. */
siArFile siswa_arMakeBuffer(void* data, size_t len);
/* Creates a 'siArFile' structure from an archive file's content in memory, while also setting the capacity. */
siArFile siswa_arMakeBufferEx(void* data, size_t len, size_t capacity);

/* Creates a 'siArFile' structure and allocates an archive file in memory from the provided capacity. */
siArFile siswa_arCreateContent(size_t capacity);
/* Creates a 'siArFile' structure and creates an archive file in memory from the provided buffer and capacity. */
siArFile siswa_arCreateContentEx(void* buffer, size_t capacity);

/* Gets the header of the archive file. */
siArHeader* siswa_arGetHeader(siArFile arFile);
/* Gets the total entry count of the archive file. */
size_t siswa_arGetEntryCount(siArFile arFile);

/* Polls for the next entry in the archive, as the data gets written to 'outEntry'
 * Returns 'SISWA_TRUE' if an entry was polled, 'SISWA_FALSE' if there are no more
 * entries in the ar file. */
siBool siswa_arEntryPoll(siArFile* arFile, siArEntry** outEntry);
/* Resets the entry offset back to the start. */
void siswa_arOffsetReset(siArFile* arFile);
/* Finds an entry matching the provided name. Returns NULL if the entry doesn't exist. */
siArEntry* siswa_arEntryFind(siArFile arFile, const char* name);
/* Finds an entry matching the provided name with length. Returns NULL if the entry doesn't exist. */
siArEntry* siswa_arEntryFindEx(siArFile arFile, const char* name, size_t nameLen);

/* Gets the name of the provided entry. */
char* siswa_arEntryGetName(siArEntry* entry);
/* Gets the data of the provided entry. */
void* siswa_arEntryGetData(siArEntry* entry);

/* Adds a new entry in the archive. Fails if the entry name already exists or the capacity is too low. */
siBool siswa_arEntryAdd(siArFile* arFile, const char* name, void* data,
		uint32_t dataSize);
/* Adds a new entry in the archive. Fails if the entry name already exists or the capacity is too low. */
siBool siswa_arEntryAddEx(siArFile* arFile, const char* name, size_t nameLen,
		void* data, uint32_t dataSize);
/* Removes an entry in the archive. Fails if the entry doesn't exist. */
siBool siswa_arEntryRemove(siArFile* arFile, const char* name);
/* Removes an entry in the archive. Fails if the entry doesn't exist. */
siBool siswa_arEntryRemoveEx(siArFile* arFile, const char* name, size_t nameLen);
/* Updates the entry inside the archive. Fails if the entry doesn't exist. */
siBool siswa_arEntryUpdate(siArFile* arFile, const char* name, void* data,
		uint32_t dataSize);
/* Updates the entry inside the archive. Fails if the entry doesn't exist. */
siBool siswa_arEntryUpdateEx(siArFile* arFile, const char* name, size_t nameLen,
		void* data, uint32_t dataSize);

/* Creates a new archive by merging two archives into it, with the content being
 * written to 'outBuffer'. Any duplicating entries from the archives get ignored.
 * Fails if the capacity is too low to fit the two archive files in 'outBuffer'. */
siArFile siswa_arMerge(siArFile ars[2], void* outBuffer, size_t capacity);
/* Creates a new archive by merging all of the archive files into it, with the content
 * being written to 'outBuffer'. Any duplicating entries from the archives get ignored.
 * Fails if the capacity is too low to fit all of the archive files in 'outBuffer'. */
siArFile siswa_arMergeMul(siArFile* arrayOfArs, size_t arrayLen, void* outBuffer,
		size_t capacity);

#ifndef SISWA_NO_DECOMPRESSION
/* Decompresses the given archive file depending on the contents of the data and
 * writes the decompressed data into 'out'. This also sets 'arl.data' to 'out'.
 * Setting 'freeCompData' to true will do 'free(arl.data)', freeing the compressed
 * data from memory. */
void siswa_arDecompress(siArFile* arl, siByte* out, size_t capacity, siBool freeCompData);
/* Decompresses the given archive linker file using SEGS decompression and writes
 * the decompressed data into 'out'. This also sets 'arl.data' to 'out'. Setting
 * 'freeCompData' to true will do 'free(arl.data)', freeing the compressed
 * data from memory. */
void siswa_arDecompressSegs(siArFile* arl, siByte *out, size_t capacity, siBool freeCompData);
/* Gets the exact, raw decompressed size of the data if it's X or SEGS compressed. */
uint64_t siswa_arGetDecompressedSize(siArFile ar);
#endif

/* Frees arFile.buffer. Same as doing free(arFile.data) */
void siswa_arFree(siArFile arFile);

typedef struct {
	/* 'ARL2' at the start of the file. */
	uint32_t identifier;
	/* Total number of archive files. */
	uint32_t archiveCount;
	/* The amount of bytes for each archive. Length of the array is 'archiveCount'.
	   archiveSizes[0] gives the 1st archive file's len, archiveSizes[1] gives
	   the 2nd and so forth. */
	uint32_t archiveSizes[SISWA_UNSPECIFIED_LEN];
} siArlHeader;
SISWA_STATIC_ASSERT(sizeof(siArlHeader) == 12);

typedef siArFile siArlFile;

typedef struct {
	/* Length of the filename. */
	uint8_t len;
	/* The filename The string is NOT null-terminated! */
	char string[SISWA_UNSPECIFIED_LEN];
} siArlEntry;
SISWA_STATIC_ASSERT(sizeof(siArlEntry) == 2);


/* Creates a 'siArlFile' structure from an '.arl' file. */
siArlFile siswa_arlMake(const char* path);
/* Creates a 'siArlFile' structure from an '.arl' file and adds additional space
 * to the capacity. */
siArlFile siswa_arlMakeEx(const char* path, size_t additionalAllocSpace);
/* Creates a 'siArlFile' structure from an archive linker's content in memory. */
siArlFile siswa_arlMakeBuffer(void* data, size_t len);
/* Creates a 'siArlFile' structure from an archive linker's content in memory,
 * while also setting the capacity. */
siArlFile siswa_arlMakeBufferEx(void* data, size_t len, size_t capacity);

/* Creates a 'siArlFile' structure and allocates an archive linker file in memory
 * from the provided capacity. */
siArlFile siswa_arlCreateContent(size_t capacity, size_t archiveCount);
/* Creates a 'siArlFile' structure and creates an archive linker in memory from the
 * provided buffer and capacity. */
