/*
libSUarchive - a light, fast and portable library for handling Sonic Unleashed's archive file formats (.ar/.arl).
===========================================================================
	- YOU MUST DEFINE 'SISWA_ARCHIVE_IMPLEMENTATION' in EXACTLY _one_ file that includes
	this header, BEFORE the include like this:

		#define SISWA_ARCHIVE_IMPLEMENTATION
		#include "libSUarchive.h"
	- All other files should just include the library without the #define macro.

    - For "release mode", you can disable safety assertions that siswa does by
    defining 'SI_UNDEFINE_ASSERT' before including the file. For a custom assertion,
    you can define a 'SISWA_ASSERT(x, msg)' beforehand.

    - By default libSUarchive uses 'stdint.h' for the standard types. If you wish
    to NOT use it, or you're using pure C89, then you can define 'SISWA_DEFINE_CUSTOM_INT_TYPES'
    before the include to disable that. As the name entails, you must now define
    your own int types as a result for the library to work. These include:
        - uint8_t - 1 byte, unsigned.
        - uint16_t - 2 bytes, unsigned.
        - uint32_t and int32_t - 4 bytes, both signed and unsigned.
        - uint64_t and int64_t - 8 bytes, both signed and unsigned.
    - If the 'sizeof' for one of the above mentioned types doesn't match, then
    the header won't compile and complain about the invalid size.

===========================================================================

LICENSE
	- This software is licensed under the zlib license (see the LICENSE in the
    bottom of the file).

WARNING
	- This library is _slightly_ experimental and features may not work as
	expected.
	- This also means that many functions are not documented.
*/

#ifndef SISWA_INCLUDE_SISWA_H
#define SISWA_INCLUDE_SISWA_H

#if defined(__cplusplus)
extern "C" {
#endif

#include <stdlib.h>
#include <stdio.h>
#include <string.h>


#if !defined(SISWA_DEFINE_CUSTOM_INT_TYPES)
    #include <stdint.h>
#endif

#if !defined(SISWA_ASSERT) && !defined(SI_UNDEFINE_ASSERT)
    #define SISWA_ASSERT(x, msg) \
        if (!(x)) { \
            fprintf(stderr, "Assertion \""  #x "\" failed at \"%s:%d\": %s\n", __FILE__, __LINE__, msg); \
            exit(1); \
        } do {} while (0)
#elif !defined(SISWA_ASSERT) && defined(SI_UNDEFINE_ASSERT)
    #define SISWA_ASSERT(x, msg)  (void*)(x); (void*)(msg)
#endif

#define SISWA_ASSERT_NOT_NULL(ptr) SISWA_ASSERT((ptr) != NULL, #ptr " must not be NULL.")

#define SISWA_STATIC_ASSERT2(cond, msg)  typedef char static_assertion_##msg[(!!(cond)) * 2 - 1] /* NOTE(EimaMei): This is absolutely stupid but somehow it works so who cares, really? */
#define SISWA_STATIC_ASSERT1(cond, line) SISWA_STATIC_ASSERT2(cond, line)
#define SISWA_STATIC_ASSERT(cond)        SISWA_STATIC_ASSERT1(cond, __LINE__)

SISWA_STATIC_ASSERT(sizeof(uint8_t) == 1);
SISWA_STATIC_ASSERT(sizeof(uint16_t) == 2);
SISWA_STATIC_ASSERT(sizeof(int32_t) == 4);
SISWA_STATIC_ASSERT(sizeof(uint32_t) == 4);
SISWA_STATIC_ASSERT(sizeof(int64_t) == 8);
SISWA_STATIC_ASSERT(sizeof(uint64_t) == 8);
SISWA_STATIC_ASSERT(sizeof(size_t) == sizeof(void*));

#ifndef siByte
    typedef uint8_t siByte;
#endif
typedef int32_t siResult;


/* The alignment value set in the archive files. The actual proper definition would be
 * the processor's computing bit (hence why Unleashed uses 64 for the alignment as
 * the X360/PS3 are both 64-bit). If for whatever reason you're planning to use the
 * library on different computing bit CPUs, you should change this value to the
 * value that matches the computing bit of the CPU, or set it as '(sizeof(size_t) * 8)'.*/
#define SISWA_DEFAULT_HEADER_ALIGNMENT 64

#define SISWA_DEFAULT_STACK_SIZE 8 * 1024 /* NOTE(EimaMei): Used for storing string pointers.
                                          The higher the value, the less likely a hash collision will happen.
                                          8kb is a good middleground balance on the major OSses, but probably not
                                          for actual embedded systems.*/

#define SISWA_SUCCESS 1
#define SISWA_FAILURE 0

#define SISWA_UNSPECIFIED_LEN 1

#define SISWA_IDENTIFIER_XCOMPRESSION 0xEE12F50F
#define SISWA_IDENTIFIER_ARL2 0x324C5241


typedef enum {
    SI_COMPRESS_NONE,
    SI_COMPRESS_XCOMPRESSION,
    SI_COMPRESS_SEGS
} siCompressType;


typedef struct {
    /* Always 0. */
    uint32_t unknown;
    /* Size of the header struct. Same as sizeof(siArHeader), always 16 bytes. */
    uint32_t headerSizeof;
    /* Size of the entry struct. Same as sizeof(siArEntry), always 20 bytes. */
    uint32_t entrySizeof;
    /* Alignment that's used, usually 64 for 64-bit CPUs. */
    uint32_t alignment;
} siArHeader;
SISWA_STATIC_ASSERT(sizeof(siArHeader) == 16);


typedef struct {
    /* Entire size of the entry. Equivalent to '.dataSize + .offset + sizeof(siArEntry) = .size'. */
    uint32_t size;
    /* Size of the file data itself. */
    uint32_t dataSize;
    /* Pointer offset to the data. Usually equivalent to 'strlen(name) + pad + sizeof(siArEntry) = .offset'. */
    uint32_t offset;
    /* The high byte of the file date. Usually 0. */
    uint32_t filedateHigh;
    /* The low byte of the file data. Usually 0. */
    uint32_t filedateLow;
} siArEntry;
SISWA_STATIC_ASSERT(sizeof(siArEntry) == 20);


typedef struct {
    /* Pointer to the contents of the data. If `siswa_xMake' or 'siswa_xCreateArContent'
     * was used, the data is malloced and must be freed. */
    siByte* data;
    /* Current length of the content. Changes between entry modifications. */
    size_t len;
    /* Total memory capacity of '.data'. */
    size_t cap;

    /* Compress type of the content. */
    siCompressType compressed;
    /* Current entry offset, modified by 'siswa_xEntryPoll'. Should not be modified otherwise.*/
    size_t curOffset;
} siArFile;


/* Creates a 'siArFile' structure from an '.ar' file. Must not be compressed. */
siArFile siswa_arMake(const char* path);
/* Creates a 'siArFile' structure from an '.ar' file and adds additional space to the capacity. Must not be compressed. */
siArFile siswa_arMakeEx(const char* path, size_t additionalAllocSpace);
/* Creates a 'siArFile' structure from an archive file's content in memory. Must not be compressed. */
siArFile siswa_arMakeBuffer(void* data, size_t len);
/* Creates a 'siArFile' structure from an archive file's content in memory, while also setting the capacity. Must not be compressed. */
siArFile siswa_arMakeBufferEx(void* data, size_t len, size_t capacity);

/* Creates a 'siArFile' structure and allocates an archive file in memory from the provided capacity. */
siArFile siswa_arCreateArContent(size_t capacity);
/* Creates a 'siArFile' structure and creates an archive file in memory from the provided buffer and capacity. */
siArFile siswa_arCreateArContentEx(void* buffer, size_t capacity);

/* Gets the header of the archive file. */
siArHeader* siswa_arGetHeader(siArFile arFile);
/* Gets the total entry count of the archive file. */
size_t siswa_arGetEntryCount(siArFile arFile);

/* Polls for the next entry in the archive. It reaches the end once it hits NULL. */
siArEntry* siswa_arEntryPoll(siArFile* arFile);
/* Finds an entry matching the provided name. Returns NULL if the entry doesn't exist. */
siArEntry* siswa_arEntryFind(siArFile arFile, const char* name);
/* Finds an entry matching the provided name with length. Returns NULL if the entry doesn't exist. */
siArEntry* siswa_arEntryFindEx(siArFile arFile, const char* name, size_t nameLen);

/* Gets the name of the provided entry. */
char* siswa_arEntryGetName(siArEntry* entry);
/* Gets the data of the provided entry. */
void* siswa_arEntryGetData(siArEntry* entry);

/* Adds a new entry in the archive. Fails if the entry name already exists or the capacity is too low. */
siResult siswa_arEntryAdd(siArFile* arFile, const char* name, void* data,
        uint32_t dataSize);
/* Adds a new entry in the archive. Fails if the entry name already exists or the capacity is too low. */
siResult siswa_arEntryAddEx(siArFile* arFile, const char* name, size_t nameLen,
        void* data, uint32_t dataSize);
/* Removes an entry in the archive. Fails if the entry doesn't exist. */
siResult siswa_arEntryRemove(siArFile* arFile, const char* name);
/* Removes an entry in the archive. Fails if the entry doesn't exist. */
siResult siswa_arEntryRemoveEx(siArFile* arFile, const char* name, size_t nameLen);
/* Updates the entry inside the archive. Fails if the entry doesn't exist. */
siResult siswa_arEntryUpdate(siArFile* arFile, const char* name, void* data,
        uint32_t dataSize);
/* Updates the entry inside the archive. Fails if the entry doesn't exist. */
siResult siswa_arEntryUpdateEx(siArFile* arFile, const char* name, size_t nameLen,
        void* data, uint32_t dataSize);

/* Creates a new archive by merging two archives into it, with the content being
 * written to 'outBuffer'. Any duplicating entries from the archives get ignored.
 * Fails if the capacity is too low to fit the two archive files in 'outBuffer'. */
siArFile siswa_arMerge(siArFile ars[2], void* outBuffer, size_t capacity);
/* Creates a new archive by merging all of the archive files into it, with the content
 * being written to 'outBuffer'. Any duplicating entries from the archives get ignored.
 * Fails if the capacity is too low to fit all of the archive files in 'outBuffer'. */
siArFile siswa_arMergeMul(siArFile* arrayOfArs, size_t arrayLen, void* outBuffer,
        size_t capacity);

/* Frees arFile.buffer. Same as doing free(arFile.data) */
void siswa_arFree(siArFile arFile);

typedef struct {
    /* 'ARL2' at the start of the file. */
    uint32_t identifier;
    /* Total number of archive files. */
    uint32_t archiveCount;
    /* The amount of bytes for each archive. Length of the array is 'archiveCount'.
       archiveSizes[0] gives the 1st archive file's len, archiveSizes[1] gives
       the 2nd and so forth. */
    uint32_t archiveSizes[SISWA_UNSPECIFIED_LEN];
} siArlHeader;
SISWA_STATIC_ASSERT(sizeof(siArlHeader) == 12);

typedef siArFile siArlFile;

typedef struct {
    /* Length of the filename. */
    uint8_t len;
    /* The filename The string is NOT null-terminated! */
    char string[SISWA_UNSPECIFIED_LEN];
} siArlEntry;
SISWA_STATIC_ASSERT(sizeof(siArlEntry) == 2);


/* Creates a 'siArlFile' structure from an '.arl' file. Must not be compressed. */
siArlFile siswa_arlMake(const char* path);
/* Creates a 'siArlFile' structure from an '.arl' file and adds additional space
 * to the capacity. Must not be compressed. */
siArlFile siswa_arlMakeEx(const char* path, size_t additionalAllocSpace);
/* Creates a 'siArlFile' structure from an archive linker's content in memory.
 * Must not be compressed. */
siArlFile siswa_arlMakeBuffer(void* data, size_t len);
/* Creates a 'siArlFile' structure from an archive linker's content in memory,
 * while also setting the capacity. Must not be compressed. */
siArlFile siswa_arlMakeBufferEx(void* data, size_t len, size_t capacity);

/* Creates a 'siArlFile' structure and allocates an archive linker file in memory
 * from the provided capacity. */
siArlFile siswa_arlCreateArlContent(size_t capacity, size_t archiveCount);
